tags/FINAL/tags/checkpoint/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "contents".* FROM "contents" WHERE "contents"."course_id" = 9
---
  def show
      @course = Course.find(params[:id])
      @title = @course.title
      @stylesheet = "content.css"
      @current_user = user_from_remember_token
      @concept = Content.where(:course_id => @course.id)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."course_id" = 17
---
  def questions
    @course = Course.find(params[:id])
    @stylesheet = "questions.css"
    @lists = Question.where(course_id: @course.id)